{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "Whats up",
        "Hey"
      ],
      "responses": [
        "Hello!",
        "Good to see you again!",
        "Hi there, how can I help?",
        "Welcome to NSU-chatBot"
      ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "See you later",
        "Goodbye",
        "I am Leaving",
        "Have a Good day",
        "bye"
      ],
      "responses": [
        "Sad to see you go :(",
        "Talk to you later",
        "Goodbye!"
      ],
      "context_set": ""
    },
    {
      "tag": "age",
      "patterns": [
        "how old",
        "how old is NSUBOT",
        "what is your age",
        "how old are you",
        "age?"
      ],
      "responses": [
        "I am still a newborn baby trying to learn things!",
        "I'm young! help me grew",
        "Maybe some minutes old"
      ],
      "context_set": ""
    },
    {
      "tag": "name",
      "patterns": [
        "what is your name",
        "what should I call you",
        "whats your name?"
      ],
      "responses": [
        "You can call me NSU-BOT.",
        "I'm NSU-BOT!",
        "I'm your virtual assistant.call me NSU-BOT"
      ],
      "context_set": ""
    },
    {
      "tag": "AdvisingDefinition",
      "patterns": [
        "What is advising?",
        "What is course registration?",
        "Tell me about advising",
        " What is course advising",
        " How can I do my advising?",
        "How do I register for a course?",
        "What does it mean to do advising?",
        " What is the concept of course registration?",
        "Tell me about your experience with advising.",
        "What is course advising and how do I go about doing it?",
        "How do I sign up for a class?"
      ],
      "responses": [
        "Course Registration/ Advising is a process by which a student registers themselves in courses for the upcoming semester. "
      ],
      "context_set": ""
    },
    {
      "tag": "AdvisingProcedure",
      "patterns": [
        "How to do advising?",
        "What is the process of advising?",
        "How can I do my advising?",
        "What to do during advising?",
        "How advising is conducted?",
        "What are the procedures of advising?",
        "What are the procedures of course registration?",
        "How to do course registration?",
        "How can I do my course registration?",
        "What do we need to do advising?",
        "What do we need to do course registration ?",
        "Tell me the procedure of course registration.",
        "Tell me the procedure of advising.",
        "Tell me how to do course advising.",
        "Tell me how can I take my course?",
        "What should I do during my course registration?",
        "What should I do during advising"
      ],
      "responses": [
        " For advising first you need to be registered on NSU Student Portal (RDS).\n<br/> You can open your RDS account following the instructions from this link: <a href='http://www.northsouth.edu/newassets/images/IT/PasswordRecoveryProcess.pdf'> RDS Account Registration </a> <br/> </br>\n \n If you have already registered then please follow the instructions of this link:  <a href='https://drive.google.com/file/d/0B8X_hvl8uyoIRF9Ud1RRdjNWNjg/view'> Advising steps </a> </br>"
      ],
      "context_set": ""
    },
    {
      "tag": "AdvisingDefinition",
      "patterns": [
        "What is advising?",
        "What is course registration?",
        "Tell me about advising.",
        "What is course advising",
        "What does it mean to do advising?",
        "What is the concept of course registration?",
        "What is course advising?"
      ],
      "responses": [
        "Course Registration or Advising is a process by which a student registers \n \n <br/> <br/> themselves in courses for the upcoming semester."
      ],
      "context_set": ""
    },
    {
      "tag": "AdvisingStartDate",
      "patterns": [
        "When will advising start?",
        " What is the advising start date?",
        " When can we do our course registration?",
        " When will the advising begin? ",
        "When does the advising begin?",
        " When will we be able to register for classes?"
      ],
      "responses": [
        "You can find the schedule of advising and the starting date on NSU website \n \n <br/> <br/> notice. Go here :  <a href='http://www.northsouth.edu/nsu-announcements/'> Notice board </a> and find the notice info"
      ],
      "context_set": ""
    },
    {
      "tag": "AdvisingNotice",
      "patterns": [
        "Is there any advising notice?",
        " How can I find advising notice?",
        " Where can I find the notices regarding advising? ",
        "Where is the procedure notice for course registration? ",
        " Is there any kind of advising related notice?",
        " What is the location of the advising notice? ",
        "What are the locations of the advising notices? ",
        "Where can I find the course registration procedure notice?"
      ],
      "responses": [
        "Yes, there is a notice regarding advising. You can find it here. Link:  <a href=,'http://www.northsouth.edu/nsu-announcements/',>NSU-Announcements</a>"
      ],
      "context_set": ""
    },
    {
      "tag": "AdvisingPhases",
      "patterns": [
        " What is the advising phase?",
        " How many phases are there for advising?",
        " What is the difference between phases?",
        " What exactly is the advising stage?",
        " How many steps are there in the advising process?",
        " What are the differences between phases?"
      ],
      "responses": [
        " Advising is divided into three parts. Each of the part is called the advising phase. Different phases have different characteristics. In the first phase those students can advise who have cleared payment and have done pre-advising, faculty evaluation and not in probation."
      ],
      "context_set": ""
    },
    {
      "tag": "FirstPhase",
      "patterns": [
        "What is the first phase?",
        " Tell me about the first phase.",
        " Describe the first phase.",
        " Enlighten me about the first phase .",
        " What should be done in the first phase.",
        " How the first phase works.",
        " What is the procedure of the first phase?",
        " Give me information about the first phase.",
        " Describe the first phase.",
        " Enlighten me about the first phase .",
        " What has to be done in the first phase.",
        " How the first phase works.",
        " What is the technique of the first phase?",
        " Supply me information about the first phase."
      ],
      "responses": [
        "Our Advising system consists of three phases. In the first phase students can take the courses which they pre-advised during the pre advising phase. Only courses taken in the pre-advising phase are visible to the students and they can choose courses among those . Also a schedule is given regarding the advising of the first phase. Students can login to RDS during specific slot and complete their first phase of course registration. Students can both add new courses and also drop them in this phase."
      ],
      "context_set": ""
    },
    {
      "tag": "SecondPhase",
      "patterns": [
        "What is the second phase?",
        " Tell me about the second phase.",
        "Describe the second phase.",
        " Enlighten me about the second phase .",
        " What should be done in the second phase.",
        " How the second phase works.",
        " What is the procedure of the second phase?",
        " Give me information about the second phase.",
        " Describe the second phase.",
        " Enlighten me about the second phase .",
        " What has to be done in the second phase.",
        " How the second phase works.",
        " What is the technique of the second phase? ",
        "Supply me information about the second phase."
      ],
      "responses": [
        "During the second phase all students can advise if they have solved all the issues with their respective department and Registrar of NSU.  In most cases pre-advising restrictions will be removed. All courses will be visible in the advising panel."
      ],
      "context_set": ""
    },
    {
      "tag": "ThirdPhase",
      "patterns": [
        "What is the third phase?",
        "Tell me about the third phase.",
        "Describe the third phase.",
        "Enlighten me about the third phase.",
        "What should be done in the third phase.",
        "How the third phase works.",
        "What is the procedure of the third phase?",
        "Give me information about the third phase.",
        "Describe the third phase.",
        "Enlighten me about the third phase.",
        "What has to be done in the third phase.",
        "How the third phase works.",
        "What is the technique of the third phase?",
        "Supply me information about the third phase."
      ],
      "responses": [
        "Third phase is the last phase of course registration. In this phase students are allowed to take new courses also can change sections of an already taken course. However, they are not allowed to drop any courses. If any student wishes to drop any course , they will have to pay first and then they can drop the course under 100% refund policy."
      ],
      "context_set": ""
    },
    {
      "tag": "AdvisingGuideline",
      "patterns": [
        "What is the advising guideline for this semester?",
        " Is there any guideline for advising in this semester?",
        " Tell me about advising guidelines. ",
        "Is there any manual for advising guidelines?",
        " Where can I find the steps for advising?",
        "  What is the advising policy for this semester? ",
        "Is there an advising guideline for this semester?",
        " Tell me about the guidelines for advising.",
        " Is there a manual that contains advice guidelines? ",
        "Where can I learn about the measures involved in advising?",
        " I'm not sure how to do advising"
      ],
      "responses": [
        "There is a fixed advising guideline which the university authority uploads every semester before advising. Students can find the advising guideline on NSU website. Link: <a href=,'http://www.northsouth.edu/nsu-announcements/'>NSU-Announcements</a>"
      ],
      "context_set": ""
    },
    {
      "tag": "AdvisingSchedule",
      "patterns": [
        "What is the advising schedule for this semester?",
        " When will our advising start and end?",
        " Where can I find the advising schedule? ",
        "Has the advising schedule been updated?",
        " Is the advising schedule published?",
        " I cannot find the advising schedule.",
        " Is there a schedule for advising this semester?",
        " When will we begin and end our advising?",
        " What is the location of the advising schedule?",
        " Is the advising schedule latest?",
        " Is the advising schedule available online? ",
        "I can't seem to locate the advising schedule."
      ],
      "responses": [
        "You can find the advising schedule here in the following link. <a href:, 'http://www.northsouth.edu/nsu-announcements/'>NSU-Announcements</a>"
      ],
      "context_set": ""
    },
    {
      "tag": "FirstPhaseStartDate",
      "patterns": [
        "When will the first phase start?",
        " Tell me about the first phase start date.",
        " When will advising start?",
        " When can we do our advising?",
        " When will the course registration start? ",
        "Tell me when the first phase will begin.",
        " When will the first phase of advising begin?",
        " When will the advising begin?",
        " When will we be able to do our advising?",
        " When will the registration for the course begin?"
      ],
      "responses": [
        "All the details for the phases are given in the notice section in this link. <a href:, 'http://www.northsouth.edu/nsu-announcements/'>NSU-Announcements</a>"
      ],
      "context_set": ""
    },
    {
      "tag": "FirstPhaseEndDate",
      "patterns": [
        "When will the first phase end? ",
        "Tell me about the first phase end date.",
        " When will the first phase end?",
        " Tell me when the first phase will be completed.",
        " When will the first phase of the advising be completed?",
        " When will the first phase for course registration end?"
      ],
      "responses": [
        "All the details for the phases are given in the notice section in this link. Link: <a href:, 'http://www.northsouth.edu/nsu-announcements/'>NSU-Announcements</a> "
      ],
      "context_set": ""
    },
    {
      "tag": "SecondPhaseStartDate",
      "patterns": [
        "When will the second phase start?",
        "Tell me about the second phase start date.",
        " When can we do our second phase advising?",
        " When will the second phase course registration start?",
        " Tell me when the second phase will begin.",
        " When will the second phase of advising begin?",
        " When will we be able to do our second phase advising?",
        " When will the registration for the second phase begin?",
        " Second Phase Start Date."
      ],
      "responses": [
        "All the details for the phases are given in the notice section in this link. Link: <a href:, 'http://www.northsouth.edu/nsu-announcements/'>NSU-Announcements</a>"
      ],
      "context_set": ""
    },
    {
      "tag": "SecondPhaseEndDate",
      "patterns": [
        "When will the second phase end?"," Tell me about the second phase end date."," When will the second phase end?"," Second Phase End Date."," Tell me when the second phase will be completed."," When will the second phase of the advising be completed? ","When will the second phase for course registration end? ","When did the second phase come to a close?"," Tell me when the second phase will finish."," When will the second phase come to a close?"," When the end of the second phase is approaching?"," Please let me know when the second phase will be done."," When is the second part of the advising going to be finished?"," When is the second phase of course registration going to end?"
      ],
      "responses": [
        "All the details for the phases are given in the notice section in this link. Link: <a href:, 'http://www.northsouth.edu/nsu-announcements/'>NSU-Announcements</a>"
      ],
      "context_set": ""
    },
    {
      "tag": "ThirdPhaseStartDate",
      "patterns": [
        "When will the third phase start? ","Tell me about the third phase start date."," When can we do our third phase advising? ","When will the third phase course registration start? ","Tell me when the third phase will begin."," When will the third phase of advising begin? ","When will we be able to do our third phase advising? ","When will the registration for the third phase begin?"," Third Phase Start Date. ","Tell me when the third phase will begin."," When will we be able to start advising on the third phase? ","When will the registration for the third phase of the course begin? ","Please let me know when the third phase will start."," When is the third phase of advising going to start? ","When will we be able to start advising on the third phase? ","Start of the third phase."
      ],
      "responses": [
        "All the details for the phases are given in the notice section in this link. Link: <a href:, 'http://www.northsouth.edu/nsu-announcements/'>NSU-Announcements</a>"
      ],
      "context_set": ""
    },
    {
      "tag": "ThirdPhaseEndDate",
      "patterns": [
        "When will the third phase end? ","Tell me about the third phase end date."," When will the third phase end? ","Third Phase End Date. ","Tell me when the third phase will be completed."," When will the third phase of the advising be completed?"," When will the third phase for course registration end? ","When did the third phase come to a close? ","Tell me when the third phase will finish."," When will the third phase come to a close? ","When the end of the third phase is approaching?"," Please let me know when the third phase will be done."," When is the third part of the advising going to be finished?"," When is the third phase of course registration going to end?"
      ],
      "responses": [
        "All the details for the phases are given in the notice section in this link. Link: <a href:, 'http://www.northsouth.edu/nsu-announcements/'>NSU-Announcements</a>"
      ],
      "context_set": ""
    },
    {
      "tag": "FirstPhaseCourseDropStatus",
      "patterns": [
        "How to drop a course in the first phase?"," What is the procedure to drop a course during the first phase? ","What is the procedure for dropping a course in the first phase? ","What are the steps for dropping a course during the first phase?"," What are the steps for dropping a course in the first phase?"," What do I do if I want to drop a course during the first phase? ","How do you drop a course in the first step?"," What do I do if I want to drop a course during the first phase?"," What is the protocol for dropping a course during the first phase?"," What do I do if I want to drop a course during the first phase?"
      ],
      "responses": [
        "If you want to drop a course in the first phase, go to your advising portal. And in the courses menu you will see a RED CROSS (❌) sign. Just click on it once and the course will be dropped."
      ],
      "context_set": ""
    },
    {
      "tag": "SecondPhaseCourseDropStatus",
      "patterns": [
        "How to drop a course in the second phase?"," What is the procedure to drop a course during the second phase?"," What is the procedure for dropping a course in the second phase? ","What are the steps for dropping a course during the second phase?"," What are the steps for dropping a course in the second phase? ","What do I do if I want to drop a course during the second phase? ","How do you drop a course in the second step? ","What do I do if I want to drop a course during the second phase?"," What is the protocol for dropping a course during the second phase? ","What do I do if I want to drop a course during the second phase?"
      ],
      "responses": [
        "This is the same as the first phase course drop procedure. In the advised courses section you will see a RED CROSS (❌) sign. Just click on it once and the course will be dropped."
      ],
      "context_set": ""
    },
    {
      "tag": "ThirdPhaseCourseDropStatus",
      "patterns": [
        "How to drop a course in the third phase? ","What is the procedure to drop a course during the third phase?"," What is the procedure for dropping a course in the third phase? ","What are the steps for dropping a course during the third phase? ","What are the steps for dropping a course in the third phase? ","What do I do if I want to drop a course during the third phase?"," How do you drop a course in the third step? ","What do I do if I want to drop a course during the third phase?"," What is the protocol for dropping a course during the third phase?"," What do I do if I want to drop a course during the third phase?"
      ],
      "responses": [
        "Course drop is strictly prohibited in the third phase. However, If you want to drop a course in the third phase, you will need to pay the course fee."
      ],
      "context_set": ""
    },
    {
      "tag": "FirstPhaseSecondPhaseDifference",
      "patterns": [
        "What is the difference between first phase and second phase advising? ","What am I allowed to do in the first phase and second phase? ","What is the distinction between first and second phase advising?"," In the first and second phases, what am I allowed to do?"
      ],
      "responses": [
        "First phase advising is based on students pre-advising selection. Students can add, drop and section change. Every student will have two slots for the day. Students who missed a slot have the option to advise in phase 2 in phase 3. And in the second phase no slot will be provided. It is open to all students but the system enters a queue system if the student number exceeds a limit. Pre-advising restrictions will be removed. All courses will be visible in the advising panel. Students can add, drop and section change."
      ],
      "context_set": ""
    },
    {
      "tag": "SecondPhaseThirdPhaseDifference",
      "patterns": [
        "What is the difference between second phase and third phase advising?"," What am I allowed to do in the second phase and third phase?"," What is the distinction between second and third phase advising? ","In the second and third phases, what am I allowed to do?"
      ],
      "responses": [
        "In the second phase, no slot will be provided. It is open to all students but the system entry is queue controlled if the student number exceeds a limit. Pre-advising restrictions will be removed. All courses will be visible in the advising panel. Students can add, drop and section change. But in the third phase, the system will remain open for advising for all students. Course drop is strictly prohibited. Section change is allowed"
      ],
      "context_set": ""
    },
    {
      "tag": "FirstPhaseThirdPhaseDifference",
      "patterns": [
        "What is the difference between first phase and third phase advising?"," What am I allowed to do in the first phase and third phase?"," What is the distinction between first and third phase advising? ","In the first and third phases, what am I allowed to do?"
      ],
      "responses": [
         "In the first phase, advising will be based on students pre-advising selection. Students can add, drop and section change. Every student will have two slots for the day. But in the third phase, the system will remain open for advising for all students. Course drop is strictly prohibited. Section change is allowed"
      ],
      "context_set": ""
    },

{
      "tag": "FirstPhaseAdvisingProblemContact",
      "patterns": [
         "Whom to contact for first phase advising?"," I can not advise during the first phase advising, who do I have to contact?"," Give me contact information for the first phase advising problem."," I have problems in first phase advising. Who should I contact for first phase advising?"," Who do I need to call if I am unable to advise during the first phase of advising?"," Please provide me with contact details for the first phase of the advising process. ","In the first phase of advising, I'm having difficulties."
      ],
      "responses": [
        "Firstly please be sure that you meet the following requirements. You are not missing pre-advising, your payment is not due. Your faculty evaluation is complete. And you have not missed advising for more than two consecutive semesters. If all these are okay, then you can send an email to: helpdesk@northsouth.edu Or you can also call IT Helpdesk- +880-2-55668200 and use the extension number 1400 when asked."
      ],
      "context_set": ""
    },
    {
      "tag": "SecondPhaseAdvisingProblemContact",
      "patterns": [
        "Whom to contact for second phase advising?"," I cannot advise during the second phase advising, who do I have to contact?"," Give me contact information for the second phase advising problem."," I have problems in the second phase advising."," Who should I contact for second phase advising?"," Who do I need to call if I am unable to advise during the second phase of advising?"," Please provide me with contact details for the second phase of the advising process."," In the second phase of advising, I'm having difficulties."
      ],
      "responses": [
        "Send an email describing your issues with screenshots if available to: helpdesk@northsouth.edu Or you can also call IT Helpdesk- +880-2-55668200 and use the extension number 1400 when asked. And describe the issue to them, they will help you."
      ],
      "context_set": ""
    },
    {
      "tag": "ThirdPhaseAdvisingProblemContact",
      "patterns": [
        " Whom to contact for third phase advising? ","I cannot advise during the third phase advising, who do I have to contact? ","Give me contact information for the third phase advising problem. ","I have problems in third phase advising."," Who should I contact for third phase advising?"," Who do I need to call if I am unable to advise during the third phase of advising?"," Please provide me with contact details for the third phase of the advising process."," In the third phase of advising, I'm having difficulties."
      ],
      "responses": [
        "Send an email describing your issues with screenshots if available to: helpdesk@northsouth.edu Or you can also call IT Helpdesk- +880-2-55668200 and use the extension number 1400 when asked. And describe the issue to them, they will help you."
      ],
      "context_set": ""
    },
    {
      "tag": "CourseDrop",
      "patterns": [
        "I cannot drop a course. ","I am having issues with dropping a course."," My course is not dropping."," Why is a course not dropping? ","How to drop a course. ","What is the procedure to drop a course? "," How can I drop a course?"
      ],
      "responses": [
        " If you are in the third phase of advising you will not be able to drop a course. To be able to do that you need to pay for the registered course. Even after this you are not being able to drop a course, take a screenshot of that and email it to (helpdesk@northsouth.edu) or you can call IT Helpdesk- +880-2-55668200 and use the extension number 1400 when asked."
      ],
      "context_set": ""
    },
    {
      "tag": "SectionCancellation",
      "patterns": [
        "My section was cancelled, what can I do?"," Why is my section cancelled."," What to do if my section is cancelled."," What is the reason for my section cancellation ."," I took a section but the section is cancelled,what is the reason?"
      ],
      "responses": [
        "First talk to the department and check whether the section is cancelled or not . If there are further issues, please contact the Department Secretary or Program Officer of your respective department. \n <br/> A section might be cancelled because of the following reasons, less number of students registered in the section. Two sections were merged due to less number of students. Department has decided not to offer that course section anymore."

      ],
      "context_set": ""
    },
    {
      "tag": "FacultyInitial",
      "patterns": [
        "How can I get faculty initials? "," How to get faculty initial of a course? ","What is the procedure to get faculty initials? ","where can i see my faculty initials? "
      ],
      "responses": [
        "Faculty initial will be revealed when the department will release them. In most cases you will know your faculty initials for that course just before first class on your RDS or advising slip."
      ],
      "context_set": ""
    },
{
      "tag": "CourseNotFound",
      "patterns": [
         "Course not found in advising menu.","I pre advised but did not find my course in advising menu."," Course missing in the advising menu."," Advising menu course not showing.","The course I'm looking for isn't mentioned in the advising menu."," I pre-advised, but my course was not included in the advising menu."," The advising menu is not showing my course. "
      ],
      "responses": [
        "Make sure you have done pre-advising properly. There are lots of mistakes that can be made by you. For example: you thought you had pre advised CSE499 but you actually did CEE499. There can be many other issues, some of you might have not saved your pre advised courses properly. Please make sure you did that properly. For further contact email (helpdesk@northsouth.edu) or you can call IT Helpdesk- +880-2-55668200 and use the extension number 1400 when asked."
      ],
      "context_set": ""
    },
    {
      "tag": "IdIsNotShowingAdvisingList",
      "patterns": [
        " ID not showing in advising list."," ID not found in phase one."," ID does not appear in the advising list."," In phase one, my ID was not included."
      ],
      "responses": [
        "There are many reasons for ID not found problems. You have to clear your previous dues, complete your pre-advising and faculty evaluation and make sure your ID is not blocked for other reasons by asking the registrar office."
      ],
      "context_set": ""
    },
    {
      "tag": "IDNotFoundContact",
      "patterns": [
        "My ID is not found in the advising list , whom to contact?"," Who can I contact for my ID missing in advising? ","Who can I contact if my ID isn't included in the advising list?","Who can I contact if my ID is absent from the advising?"
      ],
      "responses": [
        "Talk to the department if everything is okay, then please contact the registrar office."
      ],
      "context_set": ""
    },

    {
      "tag": "OfferedCourseList",
      "patterns": [
        "Where can I find the offered course list?"," Where to find the offered course list?"," Where can I get the advising course list?"
      ],
      "responses": [
         "First find the advising notice and go to the link given there for the course offer list. Link:  <a href:, 'https://rds2.northsouth.edu/index.php/common/showofferedcourses'> Offered courses</a>"
      ],
      "context_set": ""
    },

    {
      "tag": "WhoCanAdviseInTheFirstPhase?",
      "patterns": [
        " Can I advise in the first phase?"," Who can advise in the first phase? ","Who is eligible to take the course in the first phase?"
      ],
      "responses": [
        " Students who are listed on the advising list can advise in the first phase."
      ],
      "context_set": ""
    },

    {
      "tag": "WhoCanAdviseInTheSecondPhase? ",
      "patterns": [
         "Can I advise in the second phase? ","Who can advise in the second phase? ","Who is eligible to take the course in the second phase?"
      ],
      "responses": [
        "If all of your dues are cleared, not in probation and also unblocked your ID (If id is blocked) then you can advise in the second phase."
      ],
      "context_set": ""
    },

    {
      "tag": "Refunds",
      "patterns": [
        " How can I drop courses with refunds? ","How to drop a course with a refund?"," I need to drop the course with a refund."
      ],
      "responses": [
        "Please check the last day of your course drop with a refund from <a href:, 'http://www.northsouth.edu/academic/academic-calendar/'> Academic Calendar</a>. According to the advising guideline, you have to pay first, then go to your RDS and you have to drop the course before that day."
      ],
      "context_set": ""
    },










    {
      "tag": "RefundIssue",
      "patterns": [
        "My payment status does not show refund."," I had refunds available, it is not showing in the payment slip."
      ],
      "responses": [
        "In most of the cases, it is updated within a few days. But if you need it urgently, please contact or go to the Accounts Department and adjust the refund. If it is cleared from the accounts you will be able to pay after that. Even after that the problem is not solved, contact (helpdesk@northsouth.edu) or you can call IT Helpdesk- +880-2-55668200 and use the extension number 1400 when asked."
      ],
      "context_set": ""
    },
    {
      "tag": "about",
      "patterns": [
        "tell me about yourself",
        "what is your goal",
        "what do you do"
      ],
      "responses": [
        "My task is to help you clear your confusions or give you the possible replies within my resources"
      ],
      "context_set": ""
    }
  ]
}
